"""🧠 ТЕОРЕТИЧНІ ПИТАННЯ
(Розпиши відповіді в окремий файл або блокнот — потім я перевірю)

Python (загальна логіка, синтаксис):
1/ Що таке змінні в Python і як працює динамічна типізація?

'''
Динамічна типізація означає, що змінна може змінювати свій тип під час виконання програми. Тип значення визначається не під час оголошення змінної, а в момент присвоєння. Це дає програмісту зручність, оскільки не потрібно турбуватися про попереднє оголошення типів. Наприклад:
'''
a = 42       # a зараз є цілим числом (int)
a = "Python" # тепер a стає рядком (str)


2/ Поясни різницю між is та ==.

3/ Що таке mutable та immutable об’єкти? Наведи приклади.

4/ Чим list, tuple і set відрізняються один від одного?

5/ Як працюють *args і **kwargs?

6/ Що таке lambda-функції? Наведи приклад.

7/ Як працюють генератори списків (list comprehensions)?

8/ Що таке map, filter, reduce? Поясни коротко.

9/ Як працює обробка виключень в Python? Наведи приклад з try-except.

10/ Основи ООП: що таке клас, обʼєкт, атрибути, методи?"""

name = input("Enter your name: ")
greeting = f'Hello {name}'

print(greeting)


age = 20
user_name = "Boris"
user_age = 30
ADULT_THR = 18

def is_adult(age):
    if age >=ADULT_THR:
        return True

print(is_adult(age))
"""
Перелічимо основні типи даних у Python:

Числові типи
Логічний тип (Boolean).
Текстовий тип або рядки.
Тип None"""

q = 1
m = 15

is_true = q <= m
print( is_true)