'''
10.2 Напишіть програму, яка прочитає файл mbox-short.txt і визначить розподіл по годинах доби для кожного з повідомлень. Ви можете витягнути годину з рядка 'From ', знайшовши час і розділивши рядок вдруге двокрапкою.

From stephen.marquard@uct.ac.za Sat Jan  5 09:14:16 2008

Після того, як ви накопичили кількість повідомлень для кожної години, виведіть їх, відсортовані за годинами, як показано нижче (у бажаному результаті).
'''

fname = input('Enter the file name: ')
try:
    fn = open(fname)
except:
    print('File can not be opened', fname)
    quit()